 Columns . . . :    1  71           Browse                  REINALDO1/QCBLLESRC 
 SEU==>                                                                  HELLO3 
 FMT CB ......-A+++B+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++ 
        *************** Beginning of data ************************************* 
0001.00        ENVIRONMENT DIVISION.                                            
0002.00         DATA DIVISION.                                                  
0003.00         WORKING-STORAGE SECTION.                                        
0004.00         01 WS-HELLO PIC X(12).                                          
0005.00         PROCEDURE DIVISION.                                             
0006.00            MOVE "HELLO WORLD" TO WS-HELLO.                              
0007.00            DISPLAY WS-HELLO.                                            
0008.00            STOP RUN.                                                    
        ****************** End of data **************************************** 
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
                                                                                
 F3=Exit   F5=Refresh   F9=Retrieve   F10=Cursor   F11=Toggle   F12=Cancel      
 F16=Repeat find        F24=More keys                                           
                                         (C) COPYRIGHT IBM CORP. 1981, 2013.    
