//COMPILE EXEC IGYWCL,PARM=(OFFSET,NOLIST,ADV),
//     PGMLIB='&&GOSET',GOPGM=HELLO2
//COBOL.SYSIN	DD	DSN=TSOBA11.COBOL.LABS(HELLO2),DISP=SHR
//COBOL.SYSLIB	DD	DSN=TSOBA11.ONLINE.LOADLIB,DISP=SHR
//*
//STEP1		EXEC PGM=HELLO2
//STEPLIB	DD	DSN=*.COMPILE.LKED.SYSLMOD,DISP=(OLD,PASS)
//SYSOUT	DD	SYSOUT=*
//*
